Revit 2024 API
WireConduitTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual WireConduitTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As WireConduitTypeSetIterator
Visual C++
public:
virtual WireConduitTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace